Repository: joshanashakya/literature_review
Catalog: workspace/opus_corpus/wikimediav20210402(2.8k)/en-ne.tmx
Source language: en
Languages: ne

source: Rediff.com. February 1, 2005. Retrieved January 27, 2010..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ Vasudev, Aruna (1986).
ne: ↑ "Memories from Mrinalda", Rediff, Rediff.com, फेब्रुअरी १, २००५, अभिगमन मिति जनवरी २७, २०१०। .mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ Vasudev, Aruna (1986).

source: With the migration of the Cantonese people to the neighboring Hong Kong and Macau, as well as in many overseas communities, Lingnan/Cantonese culture has become an influential cultural force in the international community, and forms the basis of the cultures of Hong Kong and Macau.
ne: क्यान्टोनिज मान्छेहरूको छिमेकी शहर हङकङ र मकाउ साथै धेरै विदेशी समुदाय मा बसाइसराईले, लिंगनान/क्यान्टोनिज संस्कृति अन्तर्राष्ट्रिय समुदायमा प्रभावशाली सांस्कृतिक शक्तिको रूपमा स्थापित तथा हङकङ र मकाउ को आधार संस्कृतिको रुपमा रहेको छ ।

source: Brief history and overview
ne: इतिहास

source: Lingnan culture, or Cantonese culture, refers to the regional Chinese culture of the Southern Chinese/Lingnan twin provinces of Guangdong and Guangxi.
ne: लिंगनान संस्कृति, वा क्यान्टोनिज संस्कृति, चिनको दक्षिण भुभागको दुई प्रान्त गुआन्झोउ र गुआंगसीको क्षेत्रिय संस्कृति लाई जनाउँदछ ।

source: Strictly speaking, the term "Lingnan culture" has two definitions:
ne: लिंगनान संस्कृतिका दुई परिभाषा रहेका छन्:

source: In a purely geographical sense, the term includes not only Cantonese culture, but also the cultures of minority groups (such as the Hakkas, Teochews, Taishanese and the non-Han Zhuangs) within the Lingnan region. More typically, is only used in referring to Cantonese culture, the historically dominant cultural-linguistic force in Guangdong and Guangxi.
ne: भुगोल अनुसार यस शब्दले क्यान्टोनिज संस्कृतिलाई मात्र नभई लिंगनान क्षेत्रको अल्पसंख्यक समूहहरूलाई समेत समावेश गरेको छ । सामान्यतया यस शब्दको प्रयोग क्यान्टोनिज संस्कृतिलाई जनाउनको लागि प्रयोग गर्ने गरिन्छ ।

source: A statue from the ancient kingdom of Yue, before 200 BCE; At that time, the Lingnan region was the territory of Baiyue peoples, who were later sinicized.
ne: एेतिहािसक अधिराज ऐइ सँग सम्बन्धित मूर्ति

source: He competed in the 1984 Winter Paralympics where he won a bronze medal in downhill.[1][2]
ne: He competed in the 1984 Winter Paralympics where he won a bronze medal in downhill.

source: Retrieved 2012-01-01..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ "New Zealand Medalists". International Paralympic Committee. Retrieved 2012-01-01..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em}
ne: ↑ "Paralympics New Zealand", Paralympics.org.nz, मूलबाट २०१२-०२-२७-मा सङ्ग्रहित, अभिगमन मिति २०१२-०१-०१। .mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ "New Zealand Medalists", International Paralympic Committee, अभिगमन मिति २०१२-०१-०१। .mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em}

source: List
ne: सुची

source: Description
ne: व्याख्या

source: Matsya - fish (Paleozoic era) Kurma - amphibious tortoise (Mesozoic era)[34][35] Varaha - boar (Cenozoic era)[34][35] Narasimha - man-lion, the last animal and semi-human avatar (Cenozoic era)[34][35] Vamana - growing dwarf and first step towards the human form Parasurama - a hero, but imperfect human form Rama - another hero, physically perfect, befriends a speaking monkey deity Hanuman Krishna ([sic], Krishna)[34][35] - son of non-virgin Devanaguy ([sic], Devaki),[34][35] Buddha - the Buddhism founder Kalki - yet to happen and the savior, and is like Christian Advent, which Madame Blavatsky believed Christians "undoubtedly copied from the Hindus"[34][35]
ne: मत्स्य - माछा ( प्यालियोजोइक इरा) कुर्म - उभयचर कछुवा (मेसोजोइक इरा)[34][35] वराह - बँदेल ( सेनोजोइक इरा)[34][35] नरसिंह - नर र सिंह अर्ध मानव अवतार (सेनोजोइक इरा)[34][35] वामन - पहिलो मानव स्वरूप अवतार परशुराम - राम - नायक, आदर्श पुरुष , बनारका साथी कृष्ण बुद्ध कल्की - हुन् बाँकी[34][35]

source: Some modern interpreters sequence Vishnu's ten main avatars in a definitive order, from simple life-forms to more complex, and see the Dashavataras as a reflection, or a foreshadowing, of the modern theory of evolution. Such an interpretation was first propounded by Theosophist Helena Blavatsky in her 1877 opus Isis Unveiled, in which she proposed the following ordering of the Dashavataras:[34][35]
ne: केहि आधुनिक व्याख्याताहरुले विष्णुको दशावतारलाई सरल देखि जटिल जीवको क्रम-विकासको सिद्धान्तबाट हेर्छन । यस्तो व्याख्या सर्वप्रथम सन् १८७७ मा हेलेना ब्लावात्सकीले गरेका थिए । उनले दशावतारलाई निम्नानुसार प्रस्ताव गरेका थिए :[34][35]

source: ISBN 90-04-18791-X..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} 1 2 3 4 5 6 7 Brown, C. Mackenzie (June 2007). "The Western roots of Avataric Evolutionism in colonial India".
ne: ISBN 90-04-18791-X..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} 1 2 3 4 5 6 7 । |title= रितो (सहायता).mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ C. Mackenzie Brown (2012).

source: Zygon. 42 (2): 423–448. doi:10.1111/j.1467-9744.2007.00423.x..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ C. Mackenzie Brown (2012). Hindu Perspectives on Evolution: Darwin, Dharma, and Design.
ne: Hindu Perspectives on Evolution: Darwin, Dharma, and Design.

source: 19th century painting of avatars of Vishnu by Raja Ravi Varma.
ne: राजा रवि वर्माद्वारा १९औ शताब्दिमा सिर्जित विष्णु अवतारको चित्रकला

source: Dashavatara (/ˌdæʃəˈvætərə/; Sanskrit: दशावतार, daśāvatāra) refers to the ten primary avatars of Vishnu, the Hindu god of preservation. Vishnu is said to descend in form of an avatar to restore cosmic order. The word Dashavatara derives from daśa, meaning 'ten', and avatar (avatāra), roughly equivalent to 'incarnation'.
ne: दशावतार (/ˌdæʃəˈvætərə/; Sanskrit: दशावतार, daśāvatāra) ले पालनकर्ता भगवान विष्णुका दश मुख्य अवतारहरुलाई जनाउँछ ।. ब्रह्माण्डको नियम पालना गराउन भगवान विष्णुले अवतार लिने बताइन्छ ।

source: However, most draw from the following set of figures, omitting at least one of those listed in parentheses: Matsya, Kurma, Varaha, Narasimha, Vamana, Parashurama, Rama, Krishna, Balarama or Buddha, and Kalki. In traditions that omit Krishna, he often replaces Vishnu as the source of all avatars. Some traditions include a regional deity such as Vithoba or Jagannath in penultimate position, replacing Krishna or Buddha.
ne: दशावतारमा मत्स्य अवतार, कूर्म अवतार , बराह अवतार, नृसिँह अवतार, वामन अवतार, परशुराम अवतार ,श्रीराम अवतार, कृष्ण, बलराम वा बुद्ध र कल्की अवतार मानिन्छ । दशावतारमा कृष्णलाई नमान्ने परम्परामा , कृष्णलाई सम्पूर्ण अवतारको मूल मानिन्छ । कुनै परम्परामा कृष्ण वा बुद्धको साटो जगनाथलाई लिने गरिन्छ । कल्की बाहेक सबै अवतारहरु पृथ्वीमा देखा परि सकेका छन् भने कल्की कलि युगको अन्तिम समयमा प्रकट हुने छन् ।

source: The following table summarises the position of avatars within the Dashavatara in many but not all traditions. A number in the table indicates the position of the corresponding avatar within the Dashavatara. Two or more numbers separated by commas indicate that the position of the corresponding avatar within the Dashavatara varies between traditions.
ne: दशावतारको सुची बिभिन्न क्षेत्रअनुसार फरक फरक हुन सक्छन । तलको तालिकामा दशावतारका बिभिन्न अवतारहरुको श्रेणी सहितको सारांस प्रस्तुत गरेको छ ।

source: Avatar Position Yuga[1] Matsya 1 Satya Yuga Kurma 2 Varaha 3 Narasimha 4 Vamana 5 Treta Yuga Parashurama 6 Rama 7 Krishna (8) or (9) Dwapara Yuga Balarama (8) or (9) Dwapara Yuga Buddha (9) Kali Yuga Kalki (10)
ne: अवतार स्थान युग [1] मत्स्य १ सत्य कुर्म २ बराह ३ नारासिम्ह ४ वामन ५ त्रेता परशुराम ६ राम ७ कृष्ण (८) वा (९) द्वापर बलराम (८) वा (९) द्वापर गौतम बुद्ध (९) कलि कल्की (१०)
